# WallCrossSection Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WallCrossSection Property
ParameterTypeId Class See Also
---
"Cross-Section"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WallCrossSection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallCrossSection As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WallCrossSection {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace